app/controllers/foods_controller.rb

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @food = Food.find params[:id]

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    @food = Food.find params[:id]

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
---
  def destroy
    Food.destroy params[:id]