app/controllers/parties_controller.rb

  def new
    @party = Party.new
    @servers = Server.all
---
SELECT "servers".* FROM "servers"

  def edit
    @party = Party.find params[:id]
    @servers = Server.all
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "servers".* FROM "servers"

  def show
    @party = Party.find params[:id]
    @orders = @party.orders
    @total = 0
     @party.foods.each do |food|
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."party_id" = $1  [["party_id", 3]]
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    new_party = Party.create party_params.merge({server_id: current_server.id})
---
INSERT INTO "parties" ("guest_count", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["guest_count", 4], ["server_id", 3], ["created_at", "2016-04-20 23:49:40.489947"], ["updated_at", "2016-04-20 23:49:40.489947"]]

  def update
    party = Party.find params[:id]
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 3]]

  def destroy
    Party.destroy params[:id]
---
DELETE FROM "parties" WHERE "parties"."id" = $1  [["id", 1]]