app/controllers/sessions_controller.rb

  def create
    username = params[:username]
    password = params[:password]
    server = Server.find_by({username: username})
---
SELECT  "servers".* FROM "servers" WHERE "servers"."username" = $1 LIMIT 1  [["username", "irwin"]]